УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьДопустимыеСочетанияКодовГруппСтажа/УдалитьДопустимыеСочетанияКодовГруппСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьДопустимыеСочетанияКодовГруппСтажа</name>
  <attributes>
    <name>ТипШаблонаКПС</name>
    <comment>Тип шаблона кода позиции списка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерПравила</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУсловийТруда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПозицииСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОснованияИсчисляемогоСтажа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ФорматФОВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОснованияВыслугиЛет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьДопустимыеСочетанияКодовГруппСтажа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьПравилаПроверкиСочетанийСтажа();
	
КонецПроцедуры

Процедура ЗаполнитьПравилаПроверкиСочетанийСтажа()
	                                  
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Макет = ПолучитьМакет("СочетанияГруппСтажа");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Макет.Записать(ИмяВременногоФайла);
	
	ТаблицаСочетанийСтажа = ЗначениеИзФайла(ИмяВременногоФайла);
	
	Для Каждого СтрокаТаблицыСочетагний Из ТаблицаСочетанийСтажа Цикл
		ЗаписьСочетания = НаборЗаписей.Добавить();
		
		ЗаписьСочетания.НомерПравила = СокрЛП(СтрокаТаблицыСочетагний.НомерПравила);
		ЗаписьСочетания.КодУсловийТруда = СокрЛП(СтрокаТаблицыСочетагний.КодУсловийТруда);
		ЗаписьСочетания.КодПозицииСписка = СокрЛП(СтрокаТаблицыСочетагний.КодПозицииСписка);
		ЗаписьСочетания.КодОснованияИсчисляемогоСтажа = СокрЛП(СтрокаТаблицыСочетагний.КодОснованияИсчисляемогоСтажа);
		ЗаписьСочетания.ФорматФОВ = СокрЛП(СтрокаТаблицыСочетагний.ФорматФОВ);
		ЗаписьСочетания.КодОснованияВыслугиЛет = СокрЛП(СтрокаТаблицыСочетагний.КодОснованияВыслугиЛет);
		ЗаписьСочетания.ТипШаблонаКПС = СокрЛП(СтрокаТаблицыСочетагний.ТипШаблонаКПС);
	
		ЗаписьСочетания.ПериодС = Число(СтрокаТаблицыСочетагний.ПериодС);
		ЗаписьСочетания.ПериодПо = Число(СтрокаТаблицыСочетагний.ПериодПо);	
		
	КонецЦикла;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
